src/toir_cfe/src/InformationRegisters/проф_ПараметрыНаработкиОбъектовРемонтаКэш/проф_ПараметрыНаработкиОбъектовРемонтаКэш.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f6dfe26-bc2b-4902-8fd6-7e0e11d5e88d">
  <name>проф_ПараметрыНаработкиОбъектовРемонтаКэш</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a4cf6444-a829-4a08-aeb9-07dfbcd2c51b">
    <name>ПлановаяНаработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5283313d-46b8-4de3-a4e0-90d60286c2c1">
    <name>ПериодПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26470480-cdb7-4f59-8a3b-fa8f5e532af8">
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="77b80dc5-fa1a-4f8c-874f-53001e93d5d5">
    <name>КоэффициентИспользованияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a550ba2b-4743-46a6-9ddd-4adafe539c07">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="b1ca037f-3c27-4cd8-8ab1-c4e71fa9df75">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="212bf668-8e55-411c-8c4d-f11d2b02e993">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ababde59-2f1f-44a7-98d4-08f7899e312e">
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="2aa2e5d9-99b7-4aba-8716-37d996878c7e">
    <name>ПлановаяНаработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b2680aea-45f2-4122-b381-f641cc7278cd">
    <name>ПериодПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2598d42a-db9a-42dd-8af0-040759d58fe4">
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4cef263b-5fa1-4863-818a-7dfb0891cf97">
    <name>КоэффициентИспользованияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ecb2c69-db21-4ac7-8084-4d21792f236c">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="da33cd30-a753-4d97-bcb2-e229a3856fa6">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9e6aaa8d-44c6-4d35-804f-6ada915a8d5a">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/проф_ПараметрыНаработкиОбъектовРемонта/проф_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="712d0f38-ff01-4274-964e-69837aa6f73d">
  <name>проф_ПараметрыНаработкиОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="f604c3e2-c960-41c4-a8d4-5ef736993f1b">
    <name>ПлановаяНаработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63c5d9c8-d531-4156-bb47-7af60fb01dbb">
    <name>ПериодПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="07d048d9-d113-4916-a1d3-6041c1beb739">
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c01877a6-89b5-4fe4-b7e1-e38dc6358433">
    <name>КоэффициентИспользованияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9726bcaa-7f10-446d-abb8-fa643bca1ed5">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="239ad7c2-e8f9-4ebf-b967-5bfb50be37e7">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9e9ed97a-3874-4736-89cb-8af8bee7c669">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/CommonModules/проф_РасчетППР/Module.bsl
#Область ПрограммныйИнтерфейс

//++ Проф-ИТ, #150, Соловьев А.А., 18.08.2023

Процедура СоздатьЗаписиПараметрыНаработкиОбъектовРемонта(СтруктураДанных) Экспорт
	
	ТекстЗапроса = ВернутьТекстЗапроса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", СтруктураДанных.ТаблицаОбъектыРемонта);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецГода(СтруктураДанных.ДатаПланирования));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.проф_ПараметрыНаработкиОбъектовРемонтаКэш.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда 
			Запись = Набор[0];
		Иначе	
			Запись = Набор.Добавить();
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Набор.Записать();
		
		Набор = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Записать();
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
				
		Набор = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		//Набор.Отбор.Период.Установить(НачалоДня(ТекущаяДатаСеанса()) - 1);
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда 
			Запись = Набор[0];
		Иначе	
			Запись = Набор.Добавить();
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		//Запись.Период = НачалоДня(ТекущаяДатаСеанса()) - 1;
		Запись.Период = Выборка.Период;
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОчиститьКэшПараметрыНаработкиОбъектовРемонта(СтруктураДанных) Экспорт
	
	ТексЗапроса = ВернутьТекстЗапроса();

	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТексЗапроса,
							  "проф_ПараметрыНаработкиОбъектовРемонта",
							  "проф_ПараметрыНаработкиОбъектовРемонтаКэш");
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", СтруктураДанных.ТаблицаОбъектыРемонта);
	//Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()) - 1);
	Запрос.Текст = СтрЗаменить(ТексЗапроса, "&ТекущаяДата", "");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		//Набор.Отбор.Период.Установить(НачалоДня(ТекущаяДатаСеанса()) - 1);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Записать();
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Прочитать();

		Если Набор.Количество() > 0 Тогда 
			Запись = Набор[0];
		Иначе	
			Запись = Набор.Добавить();
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Набор.Записать();
		
		Набор = РегистрыСведений.проф_ПараметрыНаработкиОбъектовРемонтаКэш.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

//-- Проф-ИТ, #150, Соловьев А.А., 18.08.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #150, Соловьев А.А., 18.08.2023

Функция ВернутьТекстЗапроса()

	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОбъектыРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонта
	|ПОМЕСТИТЬ втТаблицаОбъектыРемонта
	|ИЗ
	|	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Период КАК Период,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПлановаяНаработка КАК ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Основной КАК Основной
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			&ТекущаяДата,
	|			ОбъектРемонта В
	|				(ВЫБРАТЬ
	|					втТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта
	|				ИЗ
	|					втТаблицаОбъектыРемонта КАК втТаблицаОбъектыРемонта)) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Период КАК Период,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПлановаяНаработка КАК ПлановаяНаработка,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
	|	проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Основной КАК Основной
	|ИЗ
	|	РегистрСведений.проф_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			&ТекущаяДата,
	|			ОбъектРемонта В
	|				(ВЫБРАТЬ
	|					втТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта
	|				ИЗ
	|					втТаблицаОбъектыРемонта КАК втТаблицаОбъектыРемонта)) КАК проф_ПараметрыНаработкиОбъектовРемонтаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

//-- Проф-ИТ, #150, Соловьев А.А., 18.08.2023

#КонецОбласти
